[
  {
    "timestamp": [0, 3],
    "text": " Let's start with deployment and onboarding."
  },
  {
    "timestamp": [3, 6.2],
    "text": " We begin by registering the employee data."
  },
  {
    "timestamp": [6.2, 13.4],
    "text": " Companies simply share their employee list, and our team uploads and validates every record to make sure the system is ready."
  },
  {
    "timestamp": [13.4, 18.5],
    "text": " Next, every worker is automatically assigned a unique FOS ID."
  },
  {
    "timestamp": [18.5, 29],
    "text": " We send these IDs directly to employees through our SMS service, completely free of cost, so everyone gets immediate access, even without a smartphone."
  },
  {
    "timestamp": [29, 35],
    "text": " To boost awareness on the factory floor, we create personalized FOS awareness cards for every employee."
  },
  {
    "timestamp": [35, 43],
    "text": " These cards include their IDs, reporting channels, and quick instructions to help everyone understand how to launch a complaint easily."
  },
  {
    "timestamp": [43, 48.28],
    "text": " During onboarding, factories also appoint investigation officers."
  },
  {
    "timestamp": [48.28, 53.24],
    "text": " These officers are responsible for resolving and documenting cases."
  },
  {
    "timestamp": [53.24, 57.32],
    "text": " Depending on the size of the facility, there can be multiple investigation officers for"
  },
  {
    "timestamp": [57.32, 61.44],
    "text": " different units, genders, or complaint categories."
  },
  {
    "timestamp": [61.44, 71],
    "text": " Each investigation officer receives secure access to the I/O portal, where they document root cause analysis, corrective and preventive actions, and upload evidence."
  },
  {
    "timestamp": [71, 85],
    "text": " To ensure a smooth rollout, our FOS team visits your facility and conducts complete on-site sessions, training workers on how to report concerns, briefing management on dashboards and responsibilities, and walking everyone through the entire system."
  },
  {
    "timestamp": [85, 92],
    "text": " Finally, our investigation officer training equips them with the skills they need, how to validate complaints,"
  },
  {
    "timestamp": [92, 97],
    "text": " build corrective action plans, upload evidence, and close cases effectively."
  },
  {
    "timestamp": [97, null],
    "text": " This ensures your grievance management system is fully functional from day one."
  }
]