[
  {
    "timestamp": [
      0,
      9
    ],
    "text": "Beyond complaints, the system also enables companies to actively listen to employees through digital in app surveys."
  },
  {
    "timestamp": [
      9,
      17
    ],
    "text": "Surveys are initiated directly from the system by defining a clear title, short description and visibility period."
  },
  {
    "timestamp": [
      17,
      26
    ],
    "text": "They can be launched in multiple languages, allowing employees to respond in their native language and improving participation and accuracy."
  },
  {
    "timestamp": [
      26,
      33
    ],
    "text": "Participants can be carefully selected based on designation department, unit or gender."
  },
  {
    "timestamp": [
      33,
      46
    ],
    "text": "The system also supports random sampling using employee IDs or CNICs, ensuring surveys remain statistically representative while maintaining data integrity."
  },
  {
    "timestamp": [
      46,
      54
    ],
    "text": "Once a survey is launched, selected employees receive automated invitations through the FOSSMS service."
  },
  {
    "timestamp": [
      54,
      63
    ],
    "text": "Each message includes a direct survey link, making it easy to participate even for employees who do not use the mobile app."
  },
  {
    "timestamp": [
      63,
      68
    ],
    "text": "Employees submit their responses at their convenience through the mobile app."
  },
  {
    "timestamp": [
      68,
      75
    ],
    "text": "All responses remain confidential, encouraging honest and unbiased feedback."
  },
  {
    "timestamp": [
      75,
      81
    ],
    "text": "As responses come in, the system automatically compiles real time survey reports."
  },
  {
    "timestamp": [
      81,
      91
    ],
    "text": "Management can instantly view response rates, summary statistics, charts and trends through the dashboard for open ended questions."
  },
  {
    "timestamp": [
      91,
      105
    ],
    "text": "Built in, AI tools analyze employee feedback and group responses by sentiment positive, neutral or negative, transforming raw input into clear, actionable insights."
  },
  {
    "timestamp": [
      105,
      null
    ],
    "text": "This digital survey module helps helps organizations switch from reactive grievance handling to proactive employee engagement and continuous improvement."
  }
]