[
  {
    "timestamp": [0, 4.64],
    "text": " Let's look at how employees can register complaints quickly and safely."
  },
  {
    "timestamp": [4.64, 8.16],
    "text": " Workers can reach FOS hotline through multiple channels,"
  },
  {
    "timestamp": [8.16, 14.24],
    "text": " toll-free hotline, SMS or WhatsApp, email, the online form, or even the mobile app."
  },
  {
    "timestamp": [15.2, 19.92],
    "text": " These options ensure that every worker, regardless of literacy or device access,"
  },
  {
    "timestamp": [19.92, 22],
    "text": " has a simple and safe way to speak up."
  },
  {
    "timestamp": [22.96, 29.4],
    "text": " For workers who contact us via phone, SMS, WhatsApp, or email, are trained FOS grievance"
  },
  {
    "timestamp": [29.4, 32.48],
    "text": " officers help them file their cases."
  },
  {
    "timestamp": [32.48, 37.76],
    "text": " We ask counter questions to extract maximum information, verify details, and launch the"
  },
  {
    "timestamp": [37.76, 39.56],
    "text": " complaint on their behalf."
  },
  {
    "timestamp": [39.56, 44.56],
    "text": " This is especially helpful for workers who aren't comfortable using digital forms."
  },
  {
    "timestamp": [44.56, 47.68],
    "text": " We provide an anonymous complaint option."
  },
  {
    "timestamp": [47.68, 52.24],
    "text": " If someone feels unsafe revealing their identity, the system hides their details from the"
  },
  {
    "timestamp": [52.24, 55.96],
    "text": " company and assigns an anonymous tracking ID."
  },
  {
    "timestamp": [55.96, 61.24],
    "text": " This is especially important for sensitive issues like harassment or discrimination."
  },
  {
    "timestamp": [61.24, 65],
    "text": " Every complaint goes through a quick review by the FOS team."
  },
  {
    "timestamp": [65, 71],
    "text": " We make sure the information is complete and properly categorized before launching it into the system."
  },
  {
    "timestamp": [71, 76],
    "text": " Once verified, the system generates a unique ticket number for each complaint."
  },
  {
    "timestamp": [76, 82],
    "text": " This ticket number is shared with the worker through an SMS so they know their concern has been officially registered."
  },
  {
    "timestamp": [82, 87.2],
    "text": " At the same time, the assigned investigation officer receives instant notifications via"
  },
  {
    "timestamp": [87.2, 89.52],
    "text": " mobile app and email."
  },
  {
    "timestamp": [89.52, 93.88],
    "text": " The case appears on their portals right away so they can begin the resolution process without"
  },
  {
    "timestamp": [93.88, 95.4],
    "text": " delay."
  },
  {
    "timestamp": [95.4, 98],
    "text": " This intake process ensures that every voice can be heard clearly, safely, and reliably."
  }
]