[
  {
    "timestamp": [0, 7],
    "text": " It's time to explore the dashboards and risk insights that give management complete visibility into grievance trends."
  },
  {
    "timestamp": [7, 16],
    "text": " The dashboard provides a real-time view of total complaints, open cases, those in-process, overdue cases, and resolve issues."
  },
  {
    "timestamp": [16, 20.2],
    "text": " This helps management quickly assess the overall situation."
  },
  {
    "timestamp": [20.2, 25.36],
    "text": " Complaints are automatically grouped into categories like wages and benefits, harassment,"
  },
  {
    "timestamp": [25.36, 30.64],
    "text": " discrimination, health and safety, working hours and ethical business."
  },
  {
    "timestamp": [30.64, 35.56],
    "text": " This allows factories to identify recurring issues and plan targeted interventions, you"
  },
  {
    "timestamp": [35.56, 40.12],
    "text": " can also view insights by unit, department or shift."
  },
  {
    "timestamp": [40.12, 43.4],
    "text": " This makes it easier to pinpoint hotspots."
  },
  {
    "timestamp": [43.4, 49.16],
    "text": " The system also tracks RCA and CAPA performance, showing how quickly issues were resolved,"
  },
  {
    "timestamp": [49.16, 53.96],
    "text": " the quality of the investigation, and whether similar complaints are recurring."
  },
  {
    "timestamp": [53.96, 59.4],
    "text": " Timeline monitoring highlights average investigation times and overdue cases."
  },
  {
    "timestamp": [59.4, 65.28],
    "text": " This helps leadership ensure that grievances are being addressed within the required timeframes."
  },
  {
    "timestamp": [65.28, 70.4],
    "text": " Workers' satisfaction indicators show how employees responded during verification calls."
  },
  {
    "timestamp": [70.4, 75.68],
    "text": " This gives management a clear picture of whether solutions are genuinely helping workers."
  },
  {
    "timestamp": [75.68, 80.96],
    "text": " You can also analyze trends over weeks, months, or years to support strategic decision-making"
  },
  {
    "timestamp": [80.96, 90.28],
    "text": " and internal planning. And finally, all reports are exportable for HRDD, ESG and CSDD compliance, making it easy"
  },
  {
    "timestamp": [90.28, 96.4],
    "text": " to prepare due diligence reports, share updates with brands and complete social audits."
  },
  {
    "timestamp": [96.4, null],
    "text": " Together, these dashboards turn grievance data into actionable insights and help build a transparent, responsible, and compliant workplace."
  }
]