[
  {
    "timestamp": [
      0,
      5
    ],
    "text": "Lets look at how employees can register complaints quickly and safely."
  },
  {
    "timestamp": [
      5,
      20
    ],
    "text": "FOS offers a complete multi channel grievance ecosystem including a toll free hotline, SMS, WhatsApp, email, an online complaint form and a mobile application."
  },
  {
    "timestamp": [
      20,
      28
    ],
    "text": "These options ensure that every worker, regardless of literacy or device access, has a simple and safe way to speak up."
  },
  {
    "timestamp": [
      28,
      34
    ],
    "text": "For workers who contact us via phone, SMS, WhatsApp or email."
  },
  {
    "timestamp": [
      34,
      40
    ],
    "text": "Our trained FOS grievance officers help them file their cases."
  },
  {
    "timestamp": [
      40,
      52
    ],
    "text": "We ask counter questions to extract maximum information, demand evidences where applicable, verify details and launch the complaint on their behalf."
  },
  {
    "timestamp": [
      52,
      57
    ],
    "text": "This is especially helpful for workers who aren't comfortable using digital forms."
  },
  {
    "timestamp": [
      57,
      60
    ],
    "text": "We provide an anonymous complaint option."
  },
  {
    "timestamp": [
      60,
      70
    ],
    "text": "If someone feels unsafe revealing their identity, the system hides their details from the company and assigns an anonymous tracking id."
  },
  {
    "timestamp": [
      70,
      77
    ],
    "text": "This is especially important for sensitive issues like harassment, discrimination or abuse."
  },
  {
    "timestamp": [
      77,
      81
    ],
    "text": "Every complaint goes through a quick review by the FOS team."
  },
  {
    "timestamp": [
      81,
      95
    ],
    "text": "This review ensures accuracy, correct categorization and completeness of information, maintaining data quality and alignment with human rights due diligence reporting standards."
  },
  {
    "timestamp": [
      95,
      101
    ],
    "text": "Once verified, the system generates a unique ticket number for each complaint."
  },
  {
    "timestamp": [
      101,
      113
    ],
    "text": "This ticket number is shared with the worker through an SMS so they know their concern has been officially registered and future tracking of the case throughout its entire life cycle."
  },
  {
    "timestamp": [
      113,
      125
    ],
    "text": "At the same time, the relevant investigation officer is automatically notified through the FOS mobile application and system generated email alerts."
  },
  {
    "timestamp": [
      125,
      132
    ],
    "text": "The case appears on their portals right away so they can begin the resolution process with without delay."
  },
  {
    "timestamp": [
      132,
      null
    ],
    "text": "This intake process ensures that every voice can be heard clearly, safely and reliably."
  }
]